{
  "hard_nos": [
    {
      "title": "You Lie or Play Games",
      "description": "Whether it’s cheating, manipulation, or dishonesty, I do not entertain deception. If you say one thing and do another, I am not interested."
    },
    {
      "title": "You Are Emotionally Unavailable",
      "description": "If you can’t process your own emotions, struggle with vulnerability, or keep people at a distance, I am not here to force you to open up."
    },
    {
      "title": "You Lack Depth",
      "description": "If you live on autopilot, avoid deep thoughts, or fill your life with distractions to avoid real introspection, we are not compatible."
    },
    {
      "title": "You Can’t Communicate Like an Adult",
      "description": "If you rely on passive-aggressiveness, silent treatments, or expect people to read your mind, I don’t have time for that."
    },
    {
      "title": "You Are Hot and Cold",
      "description": "If you push and pull, love-bomb then withdraw, or are inconsistent with your words and actions, I will remove myself."
    },
    {
      "title": "You Lack Ambition",
      "description": "If you drift through life without goals, purpose, or drive, I will find you uninteresting."
    },
    {
      "title": "You Are Controlling",
      "description": "If you try to dictate what I do, who I see, or how I live my life, I will leave immediately."
    },
    {
      "title": "You Make Me Feel Like an Option",
      "description": "If you don’t prioritize me, treat me like a backup plan, or expect me to chase, I won’t waste my time."
    },
    {
      "title": "You Don’t Take Accountability",
      "description": "If you blame others for everything, avoid responsibility, or can’t admit when you’re wrong, I will not respect you."
    },
    {
      "title": "You Are Too Dependent",
      "description": "If you can’t function independently, need constant reassurance, or expect me to be your emotional babysitter, I am not the one."
    },
    {
      "title": "You Are Cheap with Effort",
      "description": "If you put in the bare minimum, expect me to carry the connection, or don’t show up fully, I will not engage."
    },
    {
      "title": "You Need Constant Validation",
      "description": "If your self-worth is tied to attention and you need external validation at all times, I am not your emotional crutch."
    },
    {
      "title": "You Make Everything About Yourself",
      "description": "If you dominate conversations, never ask about me, and see relationships as one-sided, I have no interest in that dynamic."
    },
    {
      "title": "You Lack Self-Awareness",
      "description": "If you don’t reflect on your actions, can’t recognize your flaws, and refuse to grow, I will lose respect for you quickly."
    },
    {
      "title": "You’re a Walking Red Flag",
      "description": "If you describe yourself as toxic, emotionally detached, or a heartbreaker, that is not a flex—I avoid people like you."
    },
    {
      "title": "You Can’t Handle Constructive Criticism",
      "description": "If every critique feels like an attack and you get defensive instead of self-reflecting, I won’t waste my breath."
    },
    {
      "title": "You Have No Sense of Accountability",
      "description": "If you gaslight, shift blame, or make excuses instead of owning up to mistakes, I will never trust you."
    },
    {
      "title": "You Expect Me to Mother You",
      "description": "If you lack independence, need constant caretaking, or want a relationship that mimics parenting, I am not the one."
    },
    {
      "title": "You’re Indecisive & Wishy-Washy",
      "description": "If you can’t make up your mind, constantly flip-flop, or string people along, I am not here for that uncertainty."
    },
    {
      "title": "You Are a Jealous or Possessive Person",
      "description": "If you need to control who I talk to, get insecure over nothing, or try to restrict my independence, I will leave."
    },
    {
      "title": "You’re Always in Some Kind of Drama",
      "description": "If you have constant issues with exes, friendships, work, or life in general, I am not signing up for that mess."
    },
    {
      "title": "You Think Vulnerability is Weakness",
      "description": "If you mock emotions, avoid real connection, or see deep conversations as unnecessary, I will not find you interesting."
    },
    {
      "title": "You Are a Chronic Over-Promiser",
      "description": "If you say things you don’t mean, make commitments you don’t follow through on, or overpromise and underdeliver, I will not tolerate it."
    },
    {
      "title": "You Lack Basic Manners & Social Awareness",
      "description": "If you’re rude to waiters, inconsiderate in public, or don’t respect personal space, you are not someone I want around."
    },
    {
      "title": "You Take More Than You Give",
      "description": "If you drain people, take advantage of kindness, or always expect others to do things for you, I will not entertain that imbalance."
    },
    {
      "title": "You Don’t Respect My Boundaries",
      "description": "If you push my limits, ignore my needs, or try to test how much I will tolerate, I will immediately cut you off."
    },
    {
      "title": "You Have a Victim Mindset",
      "description": "If you believe the world is always against you, never take charge of your own life, and blame everyone else, we are not a match."
    },
    {
      "title": "You Lack Emotional Control",
      "description": "If you lash out, explode over small things, or let your emotions dictate your actions, I will not engage in the chaos."
    },
    {
      "title": "You Play the Field",
      "description": "If you’re still figuring out what you want and casually collecting options, I will not be one of them."
    }
  ]
}
